LEXICON_COMMANDS_RU: dict[str, str] = {
    '/start': 'Перезапуск бота',
    '/help': 'Краткая инструкция'
}

help_text_ru = """Это бот-продаван 🤓
Он поможет прорекламировать ваш товар на авито в пару этапов:
✏️ просканирует его на сайте авито
🔍 перепишет текст объявления так, чтоб его купил первый прохожий
✉️ опубликует ссылку на ваш товар в постоянно растущий канал

Бот умеет анализировать ваше объявление на соответствие правилам маркетинга:
1️⃣ подпишитесь на телеграм канал @avito_prodano
2️⃣ отправьте в бот ссылку на ваше объявление на сайте avito.ru
📝 получите ваше новое объявление и ссылку на него в нашем канале

Успехов с продажами!"""

start_text_ru = """Добро пожаловать в бот-продаван!
Кидайте мне ссылку на ваше объявление с Авито и я перепишу его текст 😎
"""

wrong_link_text_ru = """Это какая-то не такая ссылка 😕
По ссылке должно открываться объявление на Авито.
"""

duplicated_link_ru = """Эту ссылку я недавно обрабатывал 💯
Мне запрещено повторяться 😕
Но вы можете вернуться попозже, когда я забуду про этот разговор 😎
"""

services_text_ru = """Это бот-продаван 🤓

Он перепишет обяъвление на ваш товар с авито в пару кликов!
🔍 примеры готовых обяъвлений в канале @avito_prodano

Как начать пользоваться:
✏️ просто подпишитесь на телеграм канал @avito_prodano
2️⃣ отправьте в бот ссылку на ваше объявление на сайте avito.ru
🔍 перепишет текст объявления так, чтоб его купил первый прохожий
📝 получите ваше новое объявление и ссылку на него в нашем канале

Нажмите СТАРТ чтобы начать продавать!"""


# Description inside the Bot
# Это бот-продаван 🤓

# Что делает:
# 🔍 смотрит ваше объявление на Авито
#  ✏️ исправляет текст объявления так, чтоб его купил первый прохожий
# 🎁 бесплатно отдаёт вам продающий текст
# 📝 публикует ссылку на ваш товар в нашем канале

# Для работы бота вы должны быть на него подписаны ➡️ @avito_prodano

# Успехов с продажами! 😎